In [1]:
"""pandas is a very important library of python.it is using for manupulation of different format of data structures like csv (coma separated value),txt,JSON,ZIP etc.
it is also very fast and efficient to prepare and preprocessing  raw data like dealing with missing value,data order,reshaping,slicing, and idexing.
Likewise, it has time series features as well. Pandas deal with 3 types of data structures (read & write): Series, Data Frame and Panel.
Series is nothing but an one dimensional lebled homogenous Array. Adding two or more Series will beocme a data frame and panel is 3 dimensional array.
NumPy array is used for the implementation of Pandas data object."""

'pandas is a very important library of python.it is using for manupulation of different format of data structures like csv (coma separated value),txt,JSON,ZIP etc.\nit is also very fast and efficient to prepare and preprocessing  raw data like dealing with missing value,data order,reshaping,slicing, and idexing.\nLikewise, it has time series features as well. Pandas deal with 3 types of data structures (read & write): Series, Data Frame and Panel.\nSeries is nothing but an one dimensional lebled homogenous Array. Adding two or more Series will beocme a data frame and panel is 3 dimensional array.\nNumPy array is used for the implementation of Pandas data object.'

In [21]:
import pandas as pd
pd.__version__

'1.4.3'

In [22]:
lis1=[10,20,30,"I Love You", 40,50,60]
print(lis1)

[10, 20, 30, 'I Love You', 40, 50, 60]

In [23]:
s2=pd.Series(lis1) # for Series, Should be capital.
print(s2)

0            10
1            20
2            30
3    I Love You
4            40
5            50
6            60
dtype: object

In [5]:
# Series and adding index, data type, name etc. 

s2=pd.Series([10,20,100,500,30,40],index=["i","ii","iii","iv","v","vi"],dtype=float,name="safal")
print(s2)

i       10.0
ii      20.0
iii    100.0
iv     500.0
v       30.0
vi      40.0
Name: safal, dtype: float64

In [6]:
# Empty Series
s3=pd.Series([])
print(s3)

Series([], dtype: float64)

C:\Users\Safal Basnet\AppData\Local\Temp\ipykernel_3016\4254399744.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s3=pd.Series([])

In [7]:
# Scalar in Series:it isused as a method, inside the parenthesis.
s4=pd.Series(0.9)
print(s4)

0    0.9
dtype: float64

In [8]:
# Scalar for more series by increasing index
s5=pd.Series(0.5,index=[2,4,6,8,100,200,"love"]) # it works as a function, inside the parenthesis.
print(s5)

2       0.5
4       0.5
6       0.5
8       0.5
100     0.5
200     0.5
love    0.5
dtype: float64

In [9]:
# series using by Dictionary.
s6=pd.Series({"a":2,"b":100,"c":788}) # Do not forget.key in inverted comas "",curly brackets and semicolan(:)
print(s6)

a      2
b    100
c    788
dtype: int64

In [10]:
# values accessing through indexing in series.
s7=pd.Series([10,20,100,500,30,40,"I am successful"])
print(s7)
print()
s8=s7[1]
print(s8)
print()
s9=s7[2:]
print(s9)

0                 10
1                 20
2                100
3                500
4                 30
5                 40
6    I am successful
dtype: object

20

2                100
3                500
4                 30
5                 40
6    I am successful
dtype: object

In [11]:
s10=pd.Series([10,20,1000,500,30,40,200,12,4,3,500])
print(s10)
print()
Mx=max(s10)
print(Mx)
print()
min(s10)

0       10
1       20
2     1000
3      500
4       30
5       40
6      200
7       12
8        4
9        3
10     500
dtype: int64

1000

3

In [12]:
# Pandas also satisfies the conditional operators. 
greater=s10[s10>100]
print(greater)
print()
smaller=s10[s10<100]
print(smaller)

2     1000
3      500
6      200
10     500
dtype: int64

0    10
1    20
4    30
5    40
7    12
8     4
9     3
dtype: int64

In [13]:
smaller1=pd.Series([0,1,2,3,4,5,6])
print(smaller1)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [14]:
# The mathematical operations on series:
first=pd.Series([1,2,3,4,5,6])
print(first)
second=pd.Series([2,4,6,8,10,12])
print(second)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

In [15]:
ad=first+second
print(ad)
print()
su=(first-second)
print(su)

0     3
1     6
2     9
3    12
4    15
5    18
dtype: int64

0   -1
1   -2
2   -3
3   -4
4   -5
5   -6
dtype: int64

In [16]:
div=second/first
print(div) # What a interesting !!!

0    2.0
1    2.0
2    2.0
3    2.0
4    2.0
5    2.0
dtype: float64

In [17]:
print(second)
ne=pd.Series([11,12,13,14,15])
print(ne)
print()
mo=(ne%second==0)
print(mo)
print()
mo1=[(ne%second!=0)]==0

0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64
0    11
1    12
2    13
3    14
4    15
dtype: int64

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [18]:
# SEE How series works for the unequal data value (unmatched indexes).
# it adds two series but it links matches to series under indexes. if there is missing of each index it returs NaN(not a Number).
add=smaller1+smaller  
print(add)
print()
sub=smaller1-smaller
print(sub)

0    10.0
1    21.0
2     NaN
3     NaN
4    34.0
5    45.0
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

0   -10.0
1   -19.0
2     NaN
3     NaN
4   -26.0
5   -35.0
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

In [19]:
scal=pd.Series(2)
print(scal)
print()
scal1=pd.Series(2,index=[0,1,2,3,4,5,6,7])
print(scal1)

0    2
dtype: int64

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

In [20]:
print(smaller)
print(scal1)
print()
mult=(smaller*scal1)
print(mult)

0    10
1    20
4    30
5    40
7    12
8     4
9     3
dtype: int64
0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

0    20.0
1    40.0
2     NaN
3     NaN
4    60.0
5    80.0
6     NaN
7    24.0
8     NaN
9     NaN
dtype: float64

# Pandas Data Frame. 
###"""Pandas Data Frame is a two dimensional, same size-mutable,potentially heterogenous tabular data structure with labeled axes (Rows & columns)"""

In [21]:
# 
"""Calling pandas DataFrame(D & F are in capitals) in different ways: like in numpy arrays. (1) import pandas DataFrame (it requires to write time and again pandas 
(2) import pandas as pd (calling pandas as pd for short after onwards. )
(3) from pandas import* (it helps to reduce writing pandas time and again (using commands Pandas should not write again))"""

from pandas import*
pf=DataFrame() # making empty DataFrame 
print(pf)

Empty DataFrame
Columns: []
Index: []

In [22]:
# DataFrame with single Variable through list.

list=["a","b","c","d","e"]
DF=DataFrame(list)
DF

   0
0  a
1  b
2  c
3  d
4  e

In [23]:
Data Frame with double Variable through list (using list of list)

list1=[["a","b","c","d","e"],[1,2,3,4,5]]
DF1=DataFrame(list1)
DF1

SyntaxError: invalid syntax (1156678378.py, line 1)

In [ ]:
# Using DataFrame directly with method (which is nothing but the list of list inside the paranethesis)

DF2=DataFrame([["a","b","c","d","e"],[1,2,3,4,5],[100,200,30,400,5]])
print(DF2)

In [ ]:
# Using DataFrame using dictionary indirectly. "IMP.:" disctionary should be made {inside bracket} "KEY" and variable inside the list. 
dic1={"ID":[1,2,3,4,5,6,7,8,9,10]}
print(dic1)
print()
DF3=DataFrame(dic1)
print(DF3)

In [ ]:
# it can be used DataFrame using Dictionary (direct method) as well.
DF5=DataFrame({"ID":["a","b","c","d","e"],"Sales":[20000,30000,50000,70000,100000],"Advertisement":[
    1249ez\;x1000,2000,3000,4000,5000]})
print(DF5)

In [ ]:
import numpy as np
data=np.array([1,10,112,36,44,95,78])
print(data)
print()
data1=np.arange(1,21)
print(data1)
data2=data1.reshape(4,5)
print()
print(data2)

In [ ]:
import pandas as pd
pan=pd.DataFrame()
print(pan)

In [ ]:
pan=pd.DataFrame(data2, index=["r1",
                               "r2",
                               "r3",
                               "r4"],columns=["c1",
                                              "c2",
                                              "c3",
                                              "c4",
                                              "c5"],dtype=float)
print(pan)

In [ ]:
type(pan)

In [ ]:
pan.info() # it shows the information of the column. currently, it is showing float below.

In [ ]:
pan.head() # by defalut it shows "top 5 rows". if you specifies any number of rows inside the parenthesis, it works accordingly.

In [ ]:
pan.tail() # by defalut it shows "last 5 rows". if you specifies any number of rows inside the parenthesis, it works accordingly.

In [ ]:
pan.describe() # it describes the data frame in a descriptive ways.

# Indexing in Pandas
### two] ways:
1) columnname,# by using column name.
2) rowindex[.loc] # by using loc parameter.
3) rowindex columnindex number[.iloc]

In [ ]:
pan.head()

In [ ]:
# indexing by column.
se=pan["c1"]
type(se)

In [ ]:
type(pan["c1"])

In [ ]:
se1=pan[["c1","c2"]]
print(se1)
"""The basic difference between series and data frame has been seen.
data has presented in either single row or column meaning it is series but 
whereas data are presenting in more than rows and columns meaning it is data frame."""
print()
type(se1)

In [ ]:
# indexing by row index name (loc parameter).
lam=pan.loc["r1"]
type(lam)

In [ ]:
pan.loc[["r1","r2"]]

In [ ]:
type(pan.loc[["r1","r2"]]) # we can also assin all above as variable and perform further.

In [ ]:
pan.head()

In [ ]:
pan.iloc[1:4,2:4]

In [ ]:
pan.iloc[2,2]

In [ ]:
pan.iloc[1,3]

In [ ]:
pan.iloc[1,:2]

In [ ]:
type(pan.iloc[1,:2])

In [ ]:
pan.head()

In [ ]:
a=pan.iloc[1,0:2]

In [ ]:
b=pan.iloc[3,:2]

In [ ]:
c=a,b
c

In [ ]:
add=a+b
add

In [ ]:
mult=a*b
mult

In [ ]:
div=b/a
div
print()
pan.head()

In [ ]:
#Converting DataFrame into arrays.
pan.iloc[:,1:]

In [ ]:
# now into values 
pan.iloc[:,1:].values

In [ ]:
pan

# Basic Operations in Pandas

In [ ]:
pan.isnull().sum()

In [ ]:
pan1=np.array([4,5,6,6,6,6,8,np.nan,1,2,3,7,8,1,9,np.nan,32,7,41,55]).reshape(4,5)
print(pan1)

In [ ]:
pan2=pd.DataFrame(pan1,index=["r1","r2","r3","r4"],columns=["c1","c2","c3","c4","c5"])
print(pan2)
print()
type(pan2)

In [ ]:
pan2.isnull().sum()

In [118]:
import pandas as pd
df=pd.read_csv("C:\\Users\Safal Basnet\\Desktop\\trial\\csv_trial.csv") #path name and file name with .csv inside the inverted commas
print(df)

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [119]:
df.shape # touple way.

(6, 4)

In [120]:
# same can be seen as follows:
rows, columns=df.shape

In [121]:
rows

6

In [122]:
columns

4

In [123]:
df.columns

Index(['Day', 'temperature', 'windspeed', 'event'], dtype='object')

In [124]:
df.Day

0    01/01/2017
1    01/02/2017
2    01/03/2017
3    01/04/2017
4    01/05/2017
5    01/06/2017
Name: Day, dtype: object

In [125]:
df.event

0      Rain
1    Sunny
2      Snow
3      Snow
4      Rain
5    Sunny
Name: event, dtype: object

In [126]:
# in another way by indexing...
df["Day"]

0    01/01/2017
1    01/02/2017
2    01/03/2017
3    01/04/2017
4    01/05/2017
5    01/06/2017
Name: Day, dtype: object

In [127]:
df["event"]

0      Rain
1    Sunny
2      Snow
3      Snow
4      Rain
5    Sunny
Name: event, dtype: object

In [128]:
df[["Day","event"]]

          Day   event
0  01/01/2017    Rain
1  01/02/2017  Sunny
2  01/03/2017    Snow
3  01/04/2017    Snow
4  01/05/2017    Rain
5  01/06/2017  Sunny

In [129]:
df.columns

Index(['Day', 'temperature', 'windspeed', 'event'], dtype='object')

In [130]:
df["temperature"].max()

35

In [131]:
df.temperature.min()

24

In [132]:
df.temperature.mean()

30.5

In [133]:
df.temperature.std()

3.8858718455450894

In [134]:
print(df)
df.describe()

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

       temperature  windspeed
count     6.000000   6.000000
mean     30.500000   4.666667
std       3.885872   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [135]:
df[df.temperature>=32]

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [136]:
df[df.temperature==df.temperature.max()]

          Day  temperature  windspeed   event
1  01/02/2017           35          7  Sunny

In [137]:
# or 
df[df.temperature==df["temperature"].max()]

          Day  temperature  windspeed   event
1  01/02/2017           35          7  Sunny

In [138]:
df[["Day","temperature"]][df.temperature==df.temperature.max()]

          Day  temperature
1  01/02/2017           35

In [139]:
# any column can make as an index.
df.set_index("Day")# without inplase =true gives the same old index.
df

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [140]:
df.set_index("Day",inplace=True)
df

            temperature  windspeed   event
Day
01/01/2017           32          6    Rain
01/02/2017           35          7  Sunny
01/03/2017           28          2    Snow
01/04/2017           24          7    Snow
01/05/2017           32          4    Rain
01/06/2017           32          2  Sunny

In [141]:
df

            temperature  windspeed   event
Day
01/01/2017           32          6    Rain
01/02/2017           35          7  Sunny
01/03/2017           28          2    Snow
01/04/2017           24          7    Snow
01/05/2017           32          4    Rain
01/06/2017           32          2  Sunny

In [142]:
df.loc["01/05/2017"]

temperature      32
windspeed         4
event          Rain
Name: 01/05/2017, dtype: object

In [143]:
df.loc["01/03/2017"]

temperature      28
windspeed         2
event          Snow
Name: 01/03/2017, dtype: object

In [144]:
# Reset index at origin then,
df.reset_index(inplace=True)
df

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

## we can make DataFrame in different ways: bringing by different sources like csv files, excel files, ... and from dictionary, tuple and list as well.

In [3]:
import pandas as pd
# DataFrame through csv and excel as follows:
# CSV files. command is: frame.read_csv("path_namecsv") example.
frame=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_trial.csv") 
# single separator \ is enough after first separator.like: frame=pd.read_csv("C:\\Users\Safal Basnet\Desktop\csv_trial.csv") 
frame

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [4]:
cvdf=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_trial.csv")
cvdf

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [18]:
df1=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_try.csv")
df1

  Stocks data   Unnamed: 1 Unnamed: 2 Unnamed: 3
0         Day  temperature  windspeed      event
1  01/01/2017           32          6       Rain
2  01/02/2017           35          7     Sunny
3  01/03/2017           28          2       Snow
4  01/04/2017           24          7       Snow
5  01/05/2017           32          4       Rain
6  01/06/2017           32          2     Sunny

In [19]:
df2=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_try.csv")
df2
# Comparing df1 and df2, df2 is clean and expected.

  Stocks data   Unnamed: 1 Unnamed: 2 Unnamed: 3
0         Day  temperature  windspeed      event
1  01/01/2017           32          6       Rain
2  01/02/2017           35          7     Sunny
3  01/03/2017           28          2       Snow
4  01/04/2017           24          7       Snow
5  01/05/2017           32          4       Rain
6  01/06/2017           32          2     Sunny

In [27]:
# in other ways for the same cleaning:
df1=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_try.csv", header=1)
df1

          Day  temperature  windspeed   event
0  01/01/2017           32          6    Rain
1  01/02/2017           35          7  Sunny
2  01/03/2017           28          2    Snow
3  01/04/2017           24          7    Snow
4  01/05/2017           32          4    Rain
5  01/06/2017           32          2  Sunny

In [28]:
# If we do not have column names or headings of the DataFrame 
df2=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_no_column_name.csv")
df2

   01/01/2017  32  6    Rain
0  01/02/2017  35  7  Sunny
1  01/03/2017  28  2    Snow
2  01/04/2017  24  7    Snow
3  01/05/2017  32  4    Rain
4  01/06/2017  32  2  Sunny

In [39]:
# Column Header is not given so that it makes default names starting zero, one, two....

df2=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_no_column_name.csv", header=None)
df2

            0   1  2       3
0  01/01/2017  32  6    Rain
1  01/02/2017  35  7  Sunny
2  01/03/2017  28  2    Snow
3  01/04/2017  24  7    Snow
4  01/05/2017  32  4    Rain
5  01/06/2017  32  2  Sunny

In [41]:
# We can make header names according to our interest as follows: 
df3=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_no_column_name.csv", header=None, names=["Day","temperatue","windspeed","event"])
df3

          Day  temperatue  windspeed   event
0  01/01/2017          32          6    Rain
1  01/02/2017          35          7  Sunny
2  01/03/2017          28          2    Snow
3  01/04/2017          24          7    Snow
4  01/05/2017          32          4    Rain
5  01/06/2017          32          2  Sunny

In [10]:
# We can make header names according to our interest as follows: 
df3=pd.read_csv("C:\\Users\\Safal Basnet\\Desktop\\trial\\csv_no_column_name.csv", header=None, names=["Day","temperatue","windspeed","event"])
df3

          Day  temperatue  windspeed   event
0  01/01/2017          32          6    Rain
1  01/02/2017          35          7  Sunny
2  01/03/2017          28          2    Snow
3  01/04/2017          24          7    Snow
4  01/05/2017          32          4    Rain
5  01/06/2017          32          2  Sunny

In [11]:
# using shift + m after highlighting the merging cells,
"""seperate cell seri and s2 both are combined here althogh they were separate.
ctrl+shift minus(-) gives seperation of the code, make sure, cursor on the seperation position."""
import pandas as pd
seri =pd.Series([1,2,3,4])

s2= pd.Series([5,6,7,8,9],dtype=float)
print (seri)
print()
print(s2)

0    1
1    2
2    3
3    4
dtype: int64

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

### ler= "I am learning jupyter notebook"